// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// В решении реализовано возведение числа в степень с помощью модуля Math с выводом результата в console
// int A = new Random().Next(1,10);
// int B = new Random().Next(1,10);

// System.Console.WriteLine($"{A}^{B} = {Math.Pow(A,B)}");

